{
  "session_id": "02f766d5",
  "agent_name": "Priya",
  "start_time": "2026-01-31T21:30:20.528128",
  "end_time": "2026-01-31T21:31:51.005864",
  "duration_seconds": 90,
  "transcript": [
    {
      "speaker": "agent",
      "text": "Thank you for calling Battery Smart! My name is Priya. How may I help you today?",
      "timestamp": "2026-01-31T21:30:20.528128"
    },
    {
      "speaker": "customer",
      "text": "give me nearest battle smart station",
      "timestamp": "2026-01-31T21:30:33.617288"
    },
    {
      "speaker": "agent",
      "text": "Open the Battery Smart app and tap 'Find Station' for nearest locations with live battery availability.",
      "timestamp": "2026-01-31T21:30:34.353928"
    },
    {
      "speaker": "customer",
      "text": "I have smoke coming out of my battery what do I do",
      "timestamp": "2026-01-31T21:30:50.671604"
    },
    {
      "speaker": "agent",
      "text": "Immediately stop using your scooter and visit the nearest Battery Smart station for a safe battery swap.",
      "timestamp": "2026-01-31T21:30:51.053568"
    },
    {
      "speaker": "customer",
      "text": "I have stop using my battery tell me the next thing",
      "timestamp": "2026-01-31T21:31:18.386071"
    },
    {
      "speaker": "agent",
      "text": "Head to the nearest Battery Smart station for a swap - our team will replace it with a fully charged one.",
      "timestamp": "2026-01-31T21:31:18.809019"
    },
    {
      "speaker": "customer",
      "text": "I am in Sector 55 Gurgaon locate the nearest battery",
      "timestamp": "2026-01-31T21:31:38.718045"
    },
    {
      "speaker": "agent",
      "text": "Check the Battery Smart app for nearest stations in Sector 55, Gurgaon - it'll show live availability and directions.",
      "timestamp": "2026-01-31T21:31:39.150607"
    }
  ],
  "formatted_transcript": "Agent: Thank you for calling Battery Smart! My name is Priya. How may I help you today?\n\nCustomer: give me nearest battle smart station\n\nAgent: Open the Battery Smart app and tap 'Find Station' for nearest locations with live battery availability.\n\nCustomer: I have smoke coming out of my battery what do I do\n\nAgent: Immediately stop using your scooter and visit the nearest Battery Smart station for a safe battery swap.\n\nCustomer: I have stop using my battery tell me the next thing\n\nAgent: Head to the nearest Battery Smart station for a swap - our team will replace it with a fully charged one.\n\nCustomer: I am in Sector 55 Gurgaon locate the nearest battery\n\nAgent: Check the Battery Smart app for nearest stations in Sector 55, Gurgaon - it'll show live availability and directions."
}